app/controllers/clientes_controller.rb

SELECT "clientes".* FROM "clientes"
---
  def index
    @clientes = Cliente.all

INSERT INTO "clientes" ("nome", "cpf", "fone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nome", "Victor Raffaele"], ["cpf", "102.209.194-88"], ["fone", "83995369280"], ["created_at", "2019-05-27 22:46:12.690823"], ["updated_at", "2019-05-27 22:46:12.690823"]]
---
  def create
    @cliente = Cliente.new(cliente_params)

    respond_to do |format|
      if @cliente.save

UPDATE "clientes" SET "fone" = ?, "updated_at" = ? WHERE "clientes"."id" = ?  [["fone", "81992101444"], ["updated_at", "2019-05-28 19:24:34.350438"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @cliente.update(cliente_params)

DELETE FROM "clientes" WHERE "clientes"."id" = ?  [["id", 1]]
---
  def destroy
    @cliente.destroy

SELECT  "clientes".* FROM "clientes" WHERE "clientes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_cliente
      @cliente = Cliente.find(params[:id])