app/controllers/produtos_controller.rb

  def index
    @produtos = Produto.all
---
SELECT "produtos".* FROM "produtos"

  def create
    @produto = Produto.new(produto_params)

    respond_to do |format|
      if @produto.save
---
INSERT INTO "produtos" ("nome", "preco", "tipo", "quantidade", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nome", "Xiaomi Mi 8 lite"], ["preco", 1000.0], ["tipo", "Celular"], ["quantidade", 1], ["created_at", "2019-06-04 18:05:51.351897"], ["updated_at", "2019-06-04 18:05:51.351897"]]

  def update
    respond_to do |format|
      if @produto.update(produto_params)
---
UPDATE "produtos" SET "preco" = ?, "updated_at" = ? WHERE "produtos"."id" = ?  [["preco", 1100.0], ["updated_at", "2019-06-04 18:05:51.396383"], ["id", 1]]

  def destroy
    @produto.destroy
---
DELETE FROM "produtos" WHERE "produtos"."id" = ?  [["id", 1]]

    def set_produto
      @produto = Produto.find(params[:id])
---
SELECT  "produtos".* FROM "produtos" WHERE "produtos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]