app/controllers/vendas_controller.rb

  def index
    @vendas = Venda.all
---
SELECT "vendas".* FROM "vendas"