app/views/vendas/_form.html.erb

SELECT "produtos".* FROM "produtos"
---
    <%= form.label :produto_id %>
    <%= form.collection_select(:produto_id, Produto.all, :id, :nome, prompt: true)%>

SELECT "clientes".* FROM "clientes"
---
    <%= form.label :cliente_id %>
    <%= form.collection_select(:cliente_id, Cliente.all, :id, :nome, prompt: true)%>